import 'package:get/get.dart';

abstract class FaqPageController extends GetxController {}

class FaqPageControllerImp extends FaqPageController {
  final List<Map<String, String>> faqList = [
    {
      "question": "ما هو تطبيق سكنلي؟",
      "answer":
          "سكنلي هو تطبيق عقاري يربط البائعين والمشترين والمستأجرين بسهولة وموثوقية.",
    },
    {
      "question": "كيف يمكنني إضافة عقار؟",
      "answer":
          "يمكنك إضافة عقار من خلال الضغط على زر إضافة عقار ثم تعبئة البيانات المطلوبة.",
    },
    {
      "question": "هل الإعلان مجاني؟",
      "answer": "نعم، يمكنك نشر بعض الإعلانات مجاناً حسب سياسة التطبيق.",
    },
    {
      "question": "كيف أتواصل مع المعلن؟",
      "answer": "يمكنك التواصل مع المعلن عبر رقم الهاتف أو عبر واتساب.",
    },
    {
      "question": "هل بياناتي الشخصية آمنة؟",
      "answer": "نحن نحافظ على خصوصية المستخدمين ويتم تشفير البيانات بشكل آمن.",
    },
    {
      "question": "كيف أستعيد كلمة المرور؟",
      "answer":
          "يمكنك استعادة كلمة المرور من صفحة تسجيل الدخول عبر خيار نسيت كلمة المرور.",
    },
    {
      "question": "هل يمكنني تعديل أو حذف عقاري؟",
      "answer": "نعم، يمكنك تعديل أو حذف العقار من صفحة عقاراتي داخل الحساب.",
    },
    {
      "question": "كيف أضيف عقار إلى المفضلة؟",
      "answer":
          "اضغط على أيقونة القلب الموجودة داخل بطاقة العقار لإضافته إلى المفضلة.",
    },
  ];
  int selectedIndex = 0;
}
